## Housing Market

In [1]:
import pandas as pd
import numpy as np

#### 1. Create 3 different Series. each of length 100 as follows:
* The first a random number from 1 to 4
* The second a random number from 1 to 3
* The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype=int))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype=int))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype=int))

#### 2. Create dataframe by joining the Series by column

In [3]:
house = pd.concat([s1,s2,s3], axis=1)
house.head()

   0  1      2
0  4  2  19262
1  1  2  23843
2  2  1  29371
3  2  2  27054
4  3  1  18938

#### 3. Change the names of the columns to bedrooms, bathrooms, proce_sqr_meter

In [6]:
house.rename(columns={0:'bedrooms', 1:'bathrooms', 2:'price_sqr_meter'}, inplace=True)
house.head(2)

   bedrooms  bathrooms  price_sqr_meter
0         4          2            19262
1         1          2            23843

#### 4. Create a one column DataFrame with the values of all the 3 Series and assign it to 'bigcolumn'

In [10]:
big_col = pd.concat([s1,s2,s3], axis=0).to_frame()
# big_col = pd.DataFrame(big_col)

In [12]:
big_col.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 0 to 99
Data columns (total 1 columns):
0    300 non-null int32
dtypes: int32(1)
memory usage: 3.5 KB

In [13]:
len(big_col)

300

#### 5. Reindex the dataframe so it goes from 0 to 299

In [14]:
big_col.reset_index(drop=True, inplace=True)
big_col

         0
0        4
1        1
2        2
3        2
4        3
..     ...
295  29192
296  17928
297  21735
298  15559
299  23371

[300 rows x 1 columns]